HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxSrc_reg.h
/** \brief 630, CAN2 Service Request 0 */
#define SRC_CAN_CAN2_INT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038630u)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT0.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT0.
*/
#define SRC_CAN2INT0 (SRC_CAN_CAN2_INT0)

/** \brief 634, CAN2 Service Request 1 */
#define SRC_CAN_CAN2_INT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038634u)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT1.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT1.
*/
#define SRC_CAN2INT1 (SRC_CAN_CAN2_INT1)

/** \brief 638, CAN2 Service Request 2 */
#define SRC_CAN_CAN2_INT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038638u)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT2.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT2.
*/
#define SRC_CAN2INT2 (SRC_CAN_CAN2_INT2)

/** \brief 63C, CAN2 Service Request 3 */
#define SRC_CAN_CAN2_INT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003863Cu)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT3.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT3.
*/
#define SRC_CAN2INT3 (SRC_CAN_CAN2_INT3)

/** \brief 640, CAN2 Service Request 4 */
#define SRC_CAN_CAN2_INT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038640u)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT4.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT4.
*/
#define SRC_CAN2INT4 (SRC_CAN_CAN2_INT4)

/** \brief 644, CAN2 Service Request 5 */
#define SRC_CAN_CAN2_INT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038644u)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT5.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT5.
*/
#define SRC_CAN2INT5 (SRC_CAN_CAN2_INT5)

/** \brief 648, CAN2 Service Request 6 */
#define SRC_CAN_CAN2_INT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038648u)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT6.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT6.
*/
#define SRC_CAN2INT6 (SRC_CAN_CAN2_INT6)

/** \brief 64C, CAN2 Service Request 7 */
#define SRC_CAN_CAN2_INT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003864Cu)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT7.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT7.
*/
#define SRC_CAN2INT7 (SRC_CAN_CAN2_INT7)

/** \brief 650, CAN2 Service Request 8 */
#define SRC_CAN_CAN2_INT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038650u)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT8.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT8.
*/
#define SRC_CAN2INT8 (SRC_CAN_CAN2_INT8)

/** \brief 654, CAN2 Service Request 9 */
#define SRC_CAN_CAN2_INT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038654u)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT9.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT9.
*/
#define SRC_CAN2INT9 (SRC_CAN_CAN2_INT9)

/** \brief 658, CAN2 Service Request 10 */
#define SRC_CAN_CAN2_INT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038658u)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT10.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT10.
*/
#define SRC_CAN2INT10 (SRC_CAN_CAN2_INT10)

/** \brief 65C, CAN2 Service Request 11 */
#define SRC_CAN_CAN2_INT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003865Cu)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT11.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT11.
*/
#define SRC_CAN2INT11 (SRC_CAN_CAN2_INT11)

/** \brief 660, CAN2 Service Request 12 */
#define SRC_CAN_CAN2_INT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038660u)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT12.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT12.
*/
#define SRC_CAN2INT12 (SRC_CAN_CAN2_INT12)

/** \brief 664, CAN2 Service Request 13 */
#define SRC_CAN_CAN2_INT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038664u)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT13.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT13.
*/
#define SRC_CAN2INT13 (SRC_CAN_CAN2_INT13)

/** \brief 668, CAN2 Service Request 14 */
#define SRC_CAN_CAN2_INT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038668u)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT14.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT14.
*/
#define SRC_CAN2INT14 (SRC_CAN_CAN2_INT14)

/** \brief 66C, CAN2 Service Request 15 */
#define SRC_CAN_CAN2_INT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003866Cu)
/** Alias (User Manual Name) for SRC_CAN_CAN2_INT15.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT15.
*/
#define SRC_CAN2INT15 (SRC_CAN_CAN2_INT15)

/** \brief 670, EVADC Group 0 Service Request 0 */
#define SRC_VADC_G0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038670u)
/** Alias (User Manual Name) for SRC_VADC_G0_SR0.
* To use register names with standard convension, please use SRC_VADC_G0_SR0.
*/
#define SRC_VADCG0SR0 (SRC_VADC_G0_SR0)

/** \brief 674, EVADC Group 0 Service Request 1 */
#define SRC_VADC_G0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038674u)
/** Alias (User Manual Name) for SRC_VADC_G0_SR1.
* To use register names with standard convension, please use SRC_VADC_G0_SR1.
*/
#define SRC_VADCG0SR1 (SRC_VADC_G0_SR1)

/** \brief 678, EVADC Group 0 Service Request 2 */
#define SRC_VADC_G0_SR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038678u)
/** Alias (User Manual Name) for SRC_VADC_G0_SR2.
* To use register names with standard convension, please use SRC_VADC_G0_SR2.
*/
#define SRC_VADCG0SR2 (SRC_VADC_G0_SR2)

/** \brief 67C, EVADC Group 0 Service Request 3 */
#define SRC_VADC_G0_SR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003867Cu)
/** Alias (User Manual Name) for SRC_VADC_G0_SR3.
* To use register names with standard convension, please use SRC_VADC_G0_SR3.
*/
#define SRC_VADCG0SR3 (SRC_VADC_G0_SR3)

/** \brief 680, EVADC Group 1 Service Request 0 */
#define SRC_VADC_G1_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038680u)
/** Alias (User Manual Name) for SRC_VADC_G1_SR0.
* To use register names with standard convension, please use SRC_VADC_G1_SR0.
*/
#define SRC_VADCG1SR0 (SRC_VADC_G1_SR0)

