HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxSrc_reg.h
/** \brief 924, DAM0 Error Service Request */
#define SRC_DAM_DAM0_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038924u)
/** Alias (User Manual Name) for SRC_DAM_DAM0_ERR.
* To use register names with standard convension, please use SRC_DAM_DAM0_ERR.
*/
#define SRC_DAM0ERR (SRC_DAM_DAM0_ERR)

/** \brief 940, CIF MI Service Request */
#define SRC_CIF_CIF0_MI /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038940u)
/** Alias (User Manual Name) for SRC_CIF_CIF0_MI.
* To use register names with standard convension, please use SRC_CIF_CIF0_MI.
*/
#define SRC_CIFMI (SRC_CIF_CIF0_MI)

/** \brief 944, CIF MI EP Service Request */
#define SRC_CIF_CIF0_MIEP /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038944u)
/** Alias (User Manual Name) for SRC_CIF_CIF0_MIEP.
* To use register names with standard convension, please use SRC_CIF_CIF0_MIEP.
*/
#define SRC_CIFMIEP (SRC_CIF_CIF0_MIEP)

/** \brief 948, CIF ISP Service Request */
#define SRC_CIF_CIF0_ISP /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038948u)
/** Alias (User Manual Name) for SRC_CIF_CIF0_ISP.
* To use register names with standard convension, please use SRC_CIF_CIF0_ISP.
*/
#define SRC_CIFISP (SRC_CIF_CIF0_ISP)

/** \brief 94C, CIF MJPEG Service Request */
#define SRC_CIF_CIF0_MJPEG /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003894Cu)
/** Alias (User Manual Name) for SRC_CIF_CIF0_MJPEG.
* To use register names with standard convension, please use SRC_CIF_CIF0_MJPEG.
*/
#define SRC_CIFMJPEG (SRC_CIF_CIF0_MJPEG)

/** \brief 950, PSI5-S Service Request 0 */
#define SRC_PSI5S_PSI5S0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038950u)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR0.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR0.
*/
#define SRC_PSI5S0 (SRC_PSI5S_PSI5S0_SR0)

/** \brief 954, PSI5-S Service Request 1 */
#define SRC_PSI5S_PSI5S0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038954u)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR1.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR1.
*/
#define SRC_PSI5S1 (SRC_PSI5S_PSI5S0_SR1)

/** \brief 958, PSI5-S Service Request 2 */
#define SRC_PSI5S_PSI5S0_SR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038958u)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR2.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR2.
*/
#define SRC_PSI5S2 (SRC_PSI5S_PSI5S0_SR2)

/** \brief 95C, PSI5-S Service Request 3 */
#define SRC_PSI5S_PSI5S0_SR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003895Cu)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR3.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR3.
*/
#define SRC_PSI5S3 (SRC_PSI5S_PSI5S0_SR3)

/** \brief 960, PSI5-S Service Request 4 */
#define SRC_PSI5S_PSI5S0_SR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038960u)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR4.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR4.
*/
#define SRC_PSI5S4 (SRC_PSI5S_PSI5S0_SR4)

/** \brief 964, PSI5-S Service Request 5 */
#define SRC_PSI5S_PSI5S0_SR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038964u)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR5.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR5.
*/
#define SRC_PSI5S5 (SRC_PSI5S_PSI5S0_SR5)

/** \brief 968, PSI5-S Service Request 6 */
#define SRC_PSI5S_PSI5S0_SR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038968u)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR6.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR6.
*/
#define SRC_PSI5S6 (SRC_PSI5S_PSI5S0_SR6)

/** \brief 96C, PSI5-S Service Request 7 */
#define SRC_PSI5S_PSI5S0_SR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003896Cu)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR7.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR7.
*/
#define SRC_PSI5S7 (SRC_PSI5S_PSI5S0_SR7)

/** \brief 990, General Purpose Group 0 Service Request 0 */
#define SRC_GPSR_GPSR0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038990u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR0.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR0.
*/
#define SRC_GPSR00 (SRC_GPSR_GPSR0_SR0)

/** \brief 994, General Purpose Group 0 Service Request 1 */
#define SRC_GPSR_GPSR0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038994u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR1.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR1.
*/
#define SRC_GPSR01 (SRC_GPSR_GPSR0_SR1)

/** \brief 998, General Purpose Group 0 Service Request 2 */
#define SRC_GPSR_GPSR0_SR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038998u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR2.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR2.
*/
#define SRC_GPSR02 (SRC_GPSR_GPSR0_SR2)

/** \brief 99C, General Purpose Group 0 Service Request 3 */
#define SRC_GPSR_GPSR0_SR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003899Cu)
/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR3.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR3.
*/
#define SRC_GPSR03 (SRC_GPSR_GPSR0_SR3)

/** \brief 9A0, General Purpose Group 0 Service Request 4 */
#define SRC_GPSR_GPSR0_SR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389A0u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR4.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR4.
*/
#define SRC_GPSR04 (SRC_GPSR_GPSR0_SR4)

/** \brief 9A4, General Purpose Group 0 Service Request 5 */
#define SRC_GPSR_GPSR0_SR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389A4u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR5.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR5.
*/
#define SRC_GPSR05 (SRC_GPSR_GPSR0_SR5)

