HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxSrc_reg.h
/** \brief BA8, TIM0 Shared Service Request 6 */
#define SRC_GTM_TIM0_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BA8u)
/** Alias (User Manual Name) for SRC_GTM_TIM0_6.
* To use register names with standard convension, please use SRC_GTM_TIM0_6.
*/
#define SRC_GTMTIM06 (SRC_GTM_TIM0_6)

/** \brief BAC, TIM0 Shared Service Request 7 */
#define SRC_GTM_TIM0_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BACu)
/** Alias (User Manual Name) for SRC_GTM_TIM0_7.
* To use register names with standard convension, please use SRC_GTM_TIM0_7.
*/
#define SRC_GTMTIM07 (SRC_GTM_TIM0_7)

/** \brief BB0, TIM1 Shared Service Request 0 */
#define SRC_GTM_TIM1_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BB0u)
/** Alias (User Manual Name) for SRC_GTM_TIM1_0.
* To use register names with standard convension, please use SRC_GTM_TIM1_0.
*/
#define SRC_GTMTIM10 (SRC_GTM_TIM1_0)

/** \brief BB4, TIM1 Shared Service Request 1 */
#define SRC_GTM_TIM1_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BB4u)
/** Alias (User Manual Name) for SRC_GTM_TIM1_1.
* To use register names with standard convension, please use SRC_GTM_TIM1_1.
*/
#define SRC_GTMTIM11 (SRC_GTM_TIM1_1)

/** \brief BB8, TIM1 Shared Service Request 2 */
#define SRC_GTM_TIM1_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BB8u)
/** Alias (User Manual Name) for SRC_GTM_TIM1_2.
* To use register names with standard convension, please use SRC_GTM_TIM1_2.
*/
#define SRC_GTMTIM12 (SRC_GTM_TIM1_2)

/** \brief BBC, TIM1 Shared Service Request 3 */
#define SRC_GTM_TIM1_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BBCu)
/** Alias (User Manual Name) for SRC_GTM_TIM1_3.
* To use register names with standard convension, please use SRC_GTM_TIM1_3.
*/
#define SRC_GTMTIM13 (SRC_GTM_TIM1_3)

/** \brief BC0, TIM1 Shared Service Request 4 */
#define SRC_GTM_TIM1_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BC0u)
/** Alias (User Manual Name) for SRC_GTM_TIM1_4.
* To use register names with standard convension, please use SRC_GTM_TIM1_4.
*/
#define SRC_GTMTIM14 (SRC_GTM_TIM1_4)

/** \brief BC4, TIM1 Shared Service Request 5 */
#define SRC_GTM_TIM1_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BC4u)
/** Alias (User Manual Name) for SRC_GTM_TIM1_5.
* To use register names with standard convension, please use SRC_GTM_TIM1_5.
*/
#define SRC_GTMTIM15 (SRC_GTM_TIM1_5)

/** \brief BC8, TIM1 Shared Service Request 6 */
#define SRC_GTM_TIM1_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BC8u)
/** Alias (User Manual Name) for SRC_GTM_TIM1_6.
* To use register names with standard convension, please use SRC_GTM_TIM1_6.
*/
#define SRC_GTMTIM16 (SRC_GTM_TIM1_6)

/** \brief BCC, TIM1 Shared Service Request 7 */
#define SRC_GTM_TIM1_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BCCu)
/** Alias (User Manual Name) for SRC_GTM_TIM1_7.
* To use register names with standard convension, please use SRC_GTM_TIM1_7.
*/
#define SRC_GTMTIM17 (SRC_GTM_TIM1_7)

/** \brief BD0, TIM2 Shared Service Request 0 */
#define SRC_GTM_TIM2_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BD0u)
/** Alias (User Manual Name) for SRC_GTM_TIM2_0.
* To use register names with standard convension, please use SRC_GTM_TIM2_0.
*/
#define SRC_GTMTIM20 (SRC_GTM_TIM2_0)

/** \brief BD4, TIM2 Shared Service Request 1 */
#define SRC_GTM_TIM2_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BD4u)
/** Alias (User Manual Name) for SRC_GTM_TIM2_1.
* To use register names with standard convension, please use SRC_GTM_TIM2_1.
*/
#define SRC_GTMTIM21 (SRC_GTM_TIM2_1)

/** \brief BD8, TIM2 Shared Service Request 2 */
#define SRC_GTM_TIM2_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BD8u)
/** Alias (User Manual Name) for SRC_GTM_TIM2_2.
* To use register names with standard convension, please use SRC_GTM_TIM2_2.
*/
#define SRC_GTMTIM22 (SRC_GTM_TIM2_2)

/** \brief BDC, TIM2 Shared Service Request 3 */
#define SRC_GTM_TIM2_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BDCu)
/** Alias (User Manual Name) for SRC_GTM_TIM2_3.
* To use register names with standard convension, please use SRC_GTM_TIM2_3.
*/
#define SRC_GTMTIM23 (SRC_GTM_TIM2_3)

/** \brief BE0, TIM2 Shared Service Request 4 */
#define SRC_GTM_TIM2_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BE0u)
/** Alias (User Manual Name) for SRC_GTM_TIM2_4.
* To use register names with standard convension, please use SRC_GTM_TIM2_4.
*/
#define SRC_GTMTIM24 (SRC_GTM_TIM2_4)

/** \brief BE4, TIM2 Shared Service Request 5 */
#define SRC_GTM_TIM2_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BE4u)
/** Alias (User Manual Name) for SRC_GTM_TIM2_5.
* To use register names with standard convension, please use SRC_GTM_TIM2_5.
*/
#define SRC_GTMTIM25 (SRC_GTM_TIM2_5)

/** \brief BE8, TIM2 Shared Service Request 6 */
#define SRC_GTM_TIM2_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BE8u)
/** Alias (User Manual Name) for SRC_GTM_TIM2_6.
* To use register names with standard convension, please use SRC_GTM_TIM2_6.
*/
#define SRC_GTMTIM26 (SRC_GTM_TIM2_6)

/** \brief BEC, TIM2 Shared Service Request 7 */
#define SRC_GTM_TIM2_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BECu)
/** Alias (User Manual Name) for SRC_GTM_TIM2_7.
* To use register names with standard convension, please use SRC_GTM_TIM2_7.
*/
#define SRC_GTMTIM27 (SRC_GTM_TIM2_7)

/** \brief BF0, TIM3 Shared Service Request 0 */
#define SRC_GTM_TIM3_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BF0u)
/** Alias (User Manual Name) for SRC_GTM_TIM3_0.
* To use register names with standard convension, please use SRC_GTM_TIM3_0.
*/
#define SRC_GTMTIM30 (SRC_GTM_TIM3_0)

/** \brief BF4, TIM3 Shared Service Request 1 */
#define SRC_GTM_TIM3_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BF4u)
/** Alias (User Manual Name) for SRC_GTM_TIM3_1.
* To use register names with standard convension, please use SRC_GTM_TIM3_1.
*/
#define SRC_GTMTIM31 (SRC_GTM_TIM3_1)

/** \brief BF8, TIM3 Shared Service Request 2 */
#define SRC_GTM_TIM3_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BF8u)
/** Alias (User Manual Name) for SRC_GTM_TIM3_2.
* To use register names with standard convension, please use SRC_GTM_TIM3_2.
*/
#define SRC_GTMTIM32 (SRC_GTM_TIM3_2)

/** \brief BFC, TIM3 Shared Service Request 3 */
#define SRC_GTM_TIM3_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BFCu)
/** Alias (User Manual Name) for SRC_GTM_TIM3_3.
* To use register names with standard convension, please use SRC_GTM_TIM3_3.
*/
#define SRC_GTMTIM33 (SRC_GTM_TIM3_3)

/** \brief C00, TIM3 Shared Service Request 4 */
#define SRC_GTM_TIM3_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C00u)
/** Alias (User Manual Name) for SRC_GTM_TIM3_4.
* To use register names with standard convension, please use SRC_GTM_TIM3_4.
*/
#define SRC_GTMTIM34 (SRC_GTM_TIM3_4)

